In [ ]:
# question1

In [ ]:
# head(),tail(),read_csv(),loc(),iloc()

In [ ]:
# question2

In [7]:
import pandas as pd

columns=['A','B','C']
index=[1,2,3]

In [8]:
df = pd.DataFrame(columns=columns,index=index)

In [9]:
df

     A    B    C
1  NaN  NaN  NaN
2  NaN  NaN  NaN
3  NaN  NaN  NaN

In [ ]:
# question6

In [ ]:
read_excel()

In [ ]:
# question7

In [2]:
import pandas as pd

email=['kalishwaran469@gmail.com','kalishdhoni07@gmail.com']

df=pd.DataFrame(email,columns=['email_address'])

In [3]:
df

              email_address
0  kalishwaran469@gmail.com
1   kalishdhoni07@gmail.com

In [4]:
df['username'] = df['email_address'].str.split('@').str[0]

In [5]:
df

              email_address        username
0  kalishwaran469@gmail.com  kalishwaran469
1   kalishdhoni07@gmail.com   kalishdhoni07

In [ ]:
# question8

In [2]:
import pandas as pd

data={'A':[3,8,6,2,9],'B':[5,2,9,3,1],'C':[1,7,4,5,2]}


df=pd.DataFrame(data)

In [3]:
df

   A  B  C
0  3  5  1
1  8  2  7
2  6  9  4
3  2  3  5
4  9  1  2

In [19]:
df[(df['A']>5) & (df['B']<10)]

   A  B  C
1  8  2  7
2  6  9  4
4  9  1  2

In [4]:
df

   A  B  C
0  3  5  1
1  8  2  7
2  6  9  4
3  2  3  5
4  9  1  2

In [ ]:
# question3

In [17]:
import pandas as pd

data2={'values':[10,20,30,40,50]}

df=pd.DataFrame(data2)

In [18]:
df

   values
0      10
1      20
2      30
3      40
4      50

In [19]:
sum(df['values'][0:3])

60

In [ ]:
# question4

In [5]:
import pandas as pd

data3={'text':['i am jack kallis','i am guy with ambition','i can do anything if i am supposed to do']}

df=pd.DataFrame(data3)

In [6]:
df

                                       text
0                          i am jack kallis
1                    i am guy with ambition
2  i can do anything if i am supposed to do

In [8]:
df['word_count'] = df.text.apply(lambda x: len(x.split()))

In [9]:
df

                                       text  word_count
0                          i am jack kallis           4
1                    i am guy with ambition           5
2  i can do anything if i am supposed to do          10

In [ ]:
# question5

In [ ]:
# Size and shape of a dataframe in pandas python: Size of a dataframe is the number of fields in the dataframe which is nothing but number of rows * number of columns. Shape of a dataframe gets the number of rows and number of columns of the dataframe.

In [12]:
import pandas as pd

data4={'values':[10,20,30,40,50]}

df=pd.DataFrame(data4)

In [14]:
df.describe()

          values
count   5.000000
mean   30.000000
std    15.811388
min    10.000000
25%    20.000000
50%    30.000000
75%    40.000000
max    50.000000

In [ ]:
# qustion10

In [16]:
import pandas as pd 

dff={'Sales':[4344,4545,55,5545,55,55,5],'Date':[11,12,13,14,15,16,27]}

df=pd.DataFrame(dff)

In [17]:
df

   Sales  Date
0   4344    11
1   4545    12
2     55    13
3   5545    14
4     55    15
5     55    16
6      5    27

In [26]:
df1 = df["Sales"].rolling(window=7).mean()
print(df1)

0            NaN
1            NaN
2            NaN
3            NaN
4            NaN
5            NaN
6    2086.285714
Name: Sales, dtype: float64